"""
이름=input("이름을 입력하세요 : ")
국어=int(input("국어 성적을 입력하세요 : "))
수학=int(input("국어 성적을 입력하세요 : "))
사회=int(input("국어 성적을 입력하세요 : "))
과학=int(input("국어 성적을 입력하세요 : "))
영어=int(input("국어 성적을 입력하세요 : "))
총합=국어+수학+사회+과학+영어
평균=총합/5

print(이름, "님의 성적은 \n총합",총합, "점, 평균", 평균, "점입니다.")

name=input("이름을 입력하세요 : "); inp=float(input("국어 성적을 입력하세요 : "))
inp+=float(input("수학 성적을 입력하세요 : "))
inp+=float(input("사회 성적을 입력하세요 : "))
inp+=float(input("과학 성적을 입력하세요 : "))
inp+=float(input("영어 성적을 입력하세요 : "))
print(name, "님의 성적은 \n총합",inp, "점, 평균", inp/5, "점입니다.")


첫번째변=float(input("첫 번째 직각 변의 길이(cm) : "))
두번째변=float(input("두 번째 직각 변의 길이(cm) : "))
print("빗변의 길이는", ((첫번째변**2)+(두번째변**2))**0.5, "cm입니다.")
"""






